crud/app/controllers/articulos_controller.rb

  def index
      @articulos = Articulo.all
---
SELECT "articulos".* FROM "articulos"

  def show
    #id le dice a rails que esta ruta espera un parámetro: id, que en nuestro caso será el id del artículo.

      @articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    session[:articuloID] = params[:id]
    @articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
  # cada modelo de Rails se puede inicializar con sus respectivos atributos,
  # que se asignan automáticamente a las columnas de la base de datos respectivas.
  # En la primera línea hacemos justamente eso (recuerde que params [: article] contiene los atributos
  # que nos interesan). Entonces, @ article.save es responsable de guardar el modelo en la base de datos.
  #Finalmente, redirigimos al usuario a la acción de mostrar, que definiremos más adelante.
    @articulo = Articulo.new(articulo_params)
# retorna un boolean indicando si fue creado o no.

      if @articulo.save
---
INSERT INTO "articulos" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "andres"], ["text", "asas"], ["created_at", "2018-06-28 20:40:21.659605"], ["updated_at", "2018-06-28 20:40:21.659605"]]

  def update
  #  @articulo = Articulo.find(params[:id])
    @articulo = Articulo.find(session[:articuloID])
    session.delete(:articuloID)
    if @articulo.update(articulo_params)
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articulos" SET "text" = ?, "updated_at" = ? WHERE "articulos"."id" = ?  [["text", "holaaaa3"], ["updated_at", "2018-06-27 22:03:19.065614"], ["id", 1]]

  def destroy
    @articulo = Articulo.find(params[:id])
    @articulo.destroy
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articulos" WHERE "articulos"."id" = ?  [["id", 1]]