crud/app/controllers/productos_controller.rb

  def index
    @productos = Producto.all
---
SELECT "productos".* FROM "productos"

    def set_producto
      @producto = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]